In [467]:
import os

In [468]:
#!pip install mysql-connector

In [469]:
#!pip uninstall mysql-connector

In [470]:
#!pip install mysql-connector-python

In [471]:
import mysql.connector

In [472]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [475]:
user_name=os.environ.get('DB_USER')
password=os.environ.get('DB_PASS')

In [474]:
connection=mysql.connector.connect(host='localhost', user="root",password="harinhk",database='imdb',auth_plugin='mysql_native_password')

In [476]:
connection

In [435]:
#DML means data manipulation language #insert, update and delete are DML commands

In [436]:
#DDL commands
#Create, alter, drop, truncate ,rename, truncate, rename

In [477]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)
#estudent table is in row index 3

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3          estudent
4        helloworld
5            movies
6  movies_directors
7     movies_genres
8             roles
9           student

In [438]:
#pd.read_sql_query("DELETE FROM estudent", connection)
#this command deletes all the data from estudent table

In [439]:
#TRUNCATE table student. This is a DDL command, this can't be reverted back. all the space for student is removed
#delete is DML command

In [440]:
#difference between truncate, delete and drop
#drop means whole table is dropeed
#truncate means table structure still remains

In [478]:
pd.read_sql_query("SHOW databases", connection)

             Database
0                 db1
1                 db2
2                imdb
3  information_schema
4               mysql
5         mysqljigsaw
6  performance_schema
7              sakila
8                 sys
9               world

In [443]:
pd.read_sql_query("USE imdb", connection)

In [ ]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)

In [ ]:
pd.read_sql_query("SELECT * FROM actors", connection)

In [ ]:
pd.read_sql_query("SELECT * FROM roles", connection)

In [ ]:
#clauses in sql
#IN means exact match
#BETWEEN means range matching
#LIKE means for pattern matching

In [ ]:
pd.read_sql_query("SELECT first_name, gender from actors WHERE first_name='Michael'", connection)

In [ ]:
pd.read_sql_query("SELECT actor_id, movie_id, role from roles WHERE role='kata' OR role='Magga' or role='Gunna'", connection)

In [ ]:
pd.read_sql_query("SELECT actor_id, movie_id, role from roles WHERE role in ('kata', 'Magga', 'Gunna')", connection)

In [ ]:
pd.read_sql_query("SELECT actor_id, movie_id, role from roles WHERE role in ('kata', 'Magga', 'Gunna') AND movie_id=270714", connection)

In [ ]:
pd.read_sql_query("SELECT * FROM movies", connection)

In [ ]:
pd.read_sql_query("SELECT year, rankscore FROM movies WHERE year>=2002 and year<=2005", connection)

In [ ]:
pd.read_sql_query("SELECT year, rankscore FROM movies WHERE year BETWEEN 2002 AND 2003", connection) 
#this command same as above

In [ ]:
pd.read_sql_query("SELECT year, rankscore FROM movies WHERE year BETWEEN 2002 AND 2003 AND name ='#28'", connection)

In [ ]:
pd.read_sql_query("SELECT role from roles WHERE role like 'Karl%'", connection)

In [ ]:
pd.read_sql_query("SELECT role from roles WHERE role like '%arla'", connection)

In [ ]:
#name of roles that comprises atleast one a
pd.read_sql_query("SELECT role from roles WHERE role like '%a%'", connection)

In [ ]:
#name of roles that comprises atleast two a's
pd.read_sql_query("SELECT role from roles WHERE role like '%a%a%'", connection)

In [ ]:
#name of roles that comprises atleast three a's
pd.read_sql_query("SELECT role from roles WHERE role like '%a%a%a%'", connection)

In [ ]:
#all roles where certain number of characters
#name of roles that comprises atleast 10 characters: so kept 10 underscores
pd.read_sql_query("SELECT role from roles WHERE role like '__________'", connection)

In [ ]:
#name of roles that comprises second letter as a and fourth letter as a
pd.read_sql_query("SELECT role from roles WHERE role like '_a_a%'", connection)

In [ ]:
#value of NULL at any cell means undetermined value
#Arithmetic operation on any null value also returns NULL value
#NULL value in table is not the same as 0

In [ ]:
pd.read_sql_query("SELECT role from roles WHERE role IS null", connection)

In [ ]:
pd.read_sql_query("SELECT * FROM movies WHERE rankscore is null", connection)

In [ ]:
pd.read_sql_query("SELECT * FROM movies WHERE rankscore = null", connection) #this won't work

In [ ]:
pd.read_sql_query("SELECT * FROM movies WHERE rankscore is not null", connection)

In [ ]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE rankscore is null", connection)

In [ ]:
pd.read_sql_query("SELECT count(*) FROM movies WHERE rankscore is not null", connection)

In [ ]:
pd.read_sql_query("SELECT count(*) from roles WHERE role IS null", connection)

In [ ]:
pd.read_sql_query("SELECT count(*) from roles WHERE role IS NOT null", connection)

In [ ]:
pd.read_sql_query("SELECT * FROM movies ORDER BY year", connection) #default order is ascending

In [ ]:
pd.read_sql_query("SELECT * FROM movies ORDER BY year DESC", connection)

In [ ]:
pd.read_sql_query("SELECT * FROM movies ORDER BY name, year", connection) #ORDER BY on multiple columns
#first it will sort by first column and then by second column

In [ ]:
pd.read_sql_query("SELECT * FROM movies ORDER BY name DESC, year", connection) #ORDER BY on multiple columns

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies ORDER BY name DESC, year DESC", connection) #ORDER BY on multiple columns

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies ORDER BY year DESC, name DESC", connection) #ORDER BY on multiple columns

In [ ]:
    pd.read_sql_query("SELECT name, year FROM movies ORDER BY year DESC, name", connection) #ORDER BY on multiple columns

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies WHERE name LIKE '_a_rr%' ORDER BY year DESC", connection) 
#first WHERE is executed and then ORDER BY is executed

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies LIMIT 5", connection) 
#limits the number of records

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies LIMIT 2, 5", connection) 
#from 2nd row it is selecting 5

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies LIMIT 0, 5", connection)

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies ORDER BY year DESC LIMIT 1", connection) #ORDER BY on multiple columns

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies ORDER BY year LIMIT 3", connection) #ORDER BY on multiple columns

In [ ]:
#select clause and where clause are working in conjunction
pd.read_sql_query("SELECT name, year FROM movies WHERE name LIKE '_a_rr%' ORDER BY year DESC LIMIT 1", connection)

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies WHERE name LIKE '_a_rr%' ORDER BY year LIMIT 3", connection)

In [ ]:
pd.read_sql_query("SELECT name, year FROM movies WHERE name LIKE '_a_rr%' ORDER BY year LIMIT 1, 1", connection) 
#last but one selection

In [ ]:
#case statements
pd.read_sql_query("SET @number=10", connection)

In [ ]:
pd.read_sql_query("SELECT case(@number%2) when 0 then 'even' when 1 then 'odd' end", connection)

In [ ]:
pd.read_sql_query("SET @number=11", connection)

In [ ]:
pd.read_sql_query("SELECT case(@number%2) when 0 then 'even' when 1 then 'odd' end", connection)

In [ ]:
pd.read_sql_query("SELECT case(@number%2) when 0 then 'even' when 1 then 'odd' end as numbertype", connection)

In [ ]:
#kata magga
pd.read_sql_query("SELECT * FROM movies", connection)

In [ ]:
pd.read_sql_query("SELECT name, year, rankscore, case(year) when 1971 then rankscore+2 when 2008 then rankscore-1 else rankscore end as normrankscore FROM movies", connection)

In [ ]:
pd.read_sql_query("SELECT name, year, rankscore FROM movies", connection) 
#we haven't updated the table, above command just displays the modification but won't changes any thing inside the database

In [ ]:
pd.read_sql_query("SELECT * FROM actors", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, gender, case(gender) when 'M' then concat('Mr ', first_name) when 'F' then concat('Mrs ', first_name) end FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, gender, case(gender) when 'M' then concat('Mr ', first_name) when 'F' then concat('Mrs ', first_name) end as new_firstname FROM actors ", connection)

In [ ]:
#single row functions

In [ ]:
pd.read_sql_query("SELECT length('nhk')", connection)

In [ ]:
pd.read_sql_query("SELECT upper('nhk')", connection)

In [ ]:
pd.read_sql_query("SELECT lower('NHK')", connection)

In [ ]:
pd.read_sql_query("SELECT substring('nhkempire', 2, 4)", connection)

In [ ]:
pd.read_sql_query("SELECT instr('nhkempire', 'e')", connection)

In [ ]:
pd.read_sql_query("SELECT instr('nhkempire', 'k')", connection)

In [ ]:
pd.read_sql_query("SELECT concat('nhk', ' empire')", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, length(first_name) FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, upper(first_name) FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, last_name, concat(first_name, last_name) as full_name FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, last_name, concat(first_name, concat(' ', last_name)) as full_name FROM actors ", connection)

In [ ]:
#converting all the first letters of first_name to lower case letters
pd.read_sql_query("SELECT first_name, substring(first_name, 2, 1) FROM actors ", connection) 
#start from 2 and only get 1 character

In [ ]:
pd.read_sql_query("SELECT first_name, lower(substring(first_name, 2, 1)) as lowersecond FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, concat(lower(substring(first_name, 2, 1)), substring(first_name,3,length(first_name))) as lowersecond FROM actors ", connection)

In [ ]:
pd.read_sql_query("SELECT first_name, concat(concat(upper(substring(first_name, 1, 1)), '.'), substring(first_name, instr(first_name, ' '))) as sname FROM actors", connection)

In [ ]:
#finding middle element of a string and printing it
pd.read_sql_query("SELECT first_name, case(length(first_name)%2) when 0 then substring(first_name, length(first_name)/2,2) when 1 then substring(first_name, length(first_name)/2,1) end as middle FROM actors", connection)

In [ ]:
pd.read_sql_query("SELECT ltrim('   nhk')", connection)

In [ ]:
pd.read_sql_query("SELECT repeat('*',10)", connection)

In [ ]:
pd.read_sql_query("SHOW TABLES FROM IMDB", connection)
#imdb also working

In [444]:
pd.read_sql_query("SELECT * FROM estudent", connection)

Empty DataFrame
Columns: [sno, sname, age, marks, subject]
Index: []

In [446]:
#pd.read_sql_query("INSERT INTO estudent values(1,'        nhk',24,98,'mths')", connection)

In [447]:
pd.read_sql_query("SELECT * FROM estudent", connection)

   sno        sname  age  marks subject
0    1          nhk   24     98    mths

In [466]:
pd.read_sql_query("INSERT INTO estudent values(2,'  nhk1',24,98,'mths')", connection)

In [449]:
pd.read_sql_query("SELECT * FROM estudent", connection)

   sno        sname  age  marks subject
0    1          nhk   24     98    mths
1    2         nhk1   24     98    mths

In [450]:
pd.read_sql_query("SELECT sname, length(sname)-length(ltrim(sname)) from estudent", connection)

         sname  length(sname)-length(ltrim(sname))
0          nhk                                   8
1         nhk1                                   2

In [451]:
pd.read_sql_query("SELECT sname, repeat('*',length(sname)-length(ltrim(sname))) from estudent", connection)

         sname repeat('*',length(sname)-length(ltrim(sname)))
0          nhk                                       ********
1         nhk1                                             **

In [452]:
pd.read_sql_query("SELECT sname, length(sname)-length(ltrim(sname)), concat(repeat('*',length(sname)-length(ltrim(sname))), ltrim(sname)) from estudent", connection)

,sname,length(sname)-length(ltrim(sname)),"concat(repeat('*',length(sname)-length(ltrim(sname))), ltrim(sname))"
0,nhk,8,********nhk
1,nhk1,2,**nhk1

In [453]:
pd.read_sql_query("SELECT replace('nhk','h','H')", connection)
#this is another way of doing the same thing

  replace('nhk','h','H')
0                    nHk

In [454]:
pd.read_sql_query("SELECT * FROM estudent", connection)

   sno        sname  age  marks subject
0    1          nhk   24     98    mths
1    2         nhk1   24     98    mths

In [465]:
pd.read_sql_query("INSERT INTO estudent values(1,'nhk',244434,98,'mths')", connection)

In [464]:
pd.read_sql_query("INSERT INTO estudent values(2,'nhk1',24443434,98,'mths')", connection)

In [457]:
pd.read_sql_query("SELECT age, length(age)-4 FROM estudent", connection)

        age  length(age)-4
0        24             -2
1        24             -2
2    244434              2
3  24443434              4

In [458]:
pd.read_sql_query("SELECT age, repeat('X',length(age)-4) FROM estudent", connection)

        age repeat('X',length(age)-4)
0        24
1        24
2    244434                        XX
3  24443434                      XXXX

In [459]:
pd.read_sql_query("SELECT age, repeat('X',length(age)-4), substring(age, length(age)-4,length(age)) FROM estudent", connection)

,age,"repeat('X',length(age)-4)","substring(age, length(age)-4,length(age))"
0,24,,24
1,24,,24
2,244434,XX,44434
3,24443434,XXXX,43434

In [460]:
pd.read_sql_query("SELECT age, concat(repeat('X',length(age)-4), substring(age, length(age)-4,length(age))) as maskedage FROM estudent", connection)

        age  maskedage
0        24         24
1        24         24
2    244434    XX44434
3  24443434  XXXX43434

In [461]:
pd.read_sql_query("SELECT timestampdiff(month,'2013-03-14','2014-05-23')", connection)

   timestampdiff(month,'2013-03-14','2014-05-23')
0                                              14

In [462]:
pd.read_sql_query("SELECT timestampdiff(day,'2013-03-14','2014-05-23')", connection)

   timestampdiff(day,'2013-03-14','2014-05-23')
0                                           435

In [463]:
pd.read_sql_query("SELECT timestampdiff(year,'2013-03-14','2014-05-23')", connection)

   timestampdiff(year,'2013-03-14','2014-05-23')
0                                              1

In [480]:
pd.read_sql_query("SELECT * FROM movies", connection)

            id                                 name  year  rankscore
0            0                                  #28  2002        NaN
1            1  #7 Train: An Immigrant Journey, The  2000        NaN
2            2                                    $  1971        6.4
3            3                        $1,000 Reward  1913        NaN
4            4                        $1,000 Reward  1915        NaN
...        ...                                  ...   ...        ...
388264  412316                      "zem blch krlu"  1991        NaN
388265  412317                             "rgammk"  1995        NaN
388266  412318                         "zgnm Leyla"  2002        NaN
388267  412319                          " Istanbul"  1983        NaN
388268  412320                          "sterreich"  1958        NaN

[388269 rows x 4 columns]

In [482]:
pd.read_sql_query("SELECT *, timestampdiff(month, year, curdate()) as yearpassed FROM movies", connection)

,id,name,year,rankscore,yearpassed
0,0,#28,2002,NaN,None
1,1,"#7 Train: An Immigrant Journey, The",2000,NaN,None
2,2,$,1971,6.4,None
3,3,"$1,000 Reward",1913,NaN,None
4,4,"$1,000 Reward",1915,NaN,None
...,...,...,...,...,...
388264,412316,"""zem blch krlu""",1991,NaN,None
388265,412317,"""rgammk""",1995,NaN,None
388266,412318,"""zgnm Leyla""",2002,NaN,None
388267,412319,""" Istanbul""",1983,NaN,None
388268,412320,"""sterreich""",1958,NaN,None

In [483]:
pd.read_sql_query("SELECT *, timestampdiff(month, year, curdate()) as yearpassed, if(timestampdiff(month, year, curdate())>=1, year+1, year) as newyear FROM movies", connection)

,id,name,year,rankscore,yearpassed,newyear
0,0,#28,2002,NaN,None,2002
1,1,"#7 Train: An Immigrant Journey, The",2000,NaN,None,2000
2,2,$,1971,6.4,None,1971
3,3,"$1,000 Reward",1913,NaN,None,1913
4,4,"$1,000 Reward",1915,NaN,None,1915
...,...,...,...,...,...,...
388264,412316,"""zem blch krlu""",1991,NaN,None,1991
388265,412317,"""rgammk""",1995,NaN,None,1995
388266,412318,"""zgnm Leyla""",2002,NaN,None,2002
388267,412319,""" Istanbul""",1983,NaN,None,1983
388268,412320,"""sterreich""",1958,NaN,None,1958

In [484]:
pd.read_sql_query("SELECT quarter(curdate())", connection)

   quarter(curdate())
0                   2

In [486]:
pd.read_sql_query("SELECT dayname(curdate())", connection)

  dayname(curdate())
0             Sunday

In [488]:
pd.read_sql_query("SELECT case(dayname(curdate())) when 'Sunday' then 'weekend' when 'Saturday' then 'weekend' else 'weekday' end as dayofweek", connection)

  dayofweek
0   weekend

In [489]:
pd.read_sql_query("SELECT extract(month from curdate())", connection)

   extract(month from curdate())
0                              5

In [490]:
pd.read_sql_query("SELECT extract(year from curdate())", connection)

   extract(year from curdate())
0                          2020

In [493]:
pd.read_sql_query("SELECT STR_TO_DATE('04/31/2004', '%m/%d/%Y')", connection)

  STR_TO_DATE('04/31/2004', '%m/%d/%Y')
0                                  None

In [497]:
pd.read_sql_query("SELECT STR_TO_DATE('August 10 2017', '%M %d %Y')", connection)

  STR_TO_DATE('August 10 2017', '%M %d %Y')
0                                2017-08-10

In [498]:
pd.read_sql_query("SELECT STR_TO_DATE('August,5,2017', '%M %e %Y')", connection)

  STR_TO_DATE('August,5,2017', '%M %e %Y')
0                                     None